## <span style = 'background:orange'> Pandas Basics </span>

In [4]:
import pandas as pd
import numpy as np

In [5]:
# Assignment

s1 = pd.Series([1, 2, 3, 'NA', 'NA'])

s1 = s1.replace('NA', pd.NA)

In [6]:
na_values = s1.isna()
print(na_values)

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [7]:
data = {'Name': ['Pablo', 'Susan', 'King', 'Queen'],
        'Age': [23,24,25,40]}

In [8]:
print(data)

{'Name': ['Pablo', 'Susan', 'King', 'Queen'], 'Age': [23, 24, 25, 40]}

In [9]:
data = pd.DataFrame(data)

In [10]:
data

    Name  Age
0  Pablo   23
1  Susan   24
2   King   25
3  Queen   40

In [11]:
data[:3] #slicing in a dataframe

    Name  Age
0  Pablo   23
1  Susan   24
2   King   25

In [12]:
data.sort_values('Age') # Sorting the Age column

    Name  Age
0  Pablo   23
1  Susan   24
2   King   25
3  Queen   40

In [33]:
df2 = data[data['Age'] > 23]
print(df2)

    Name  Age
1  Susan   24
2   King   25
3  Queen   40

In [14]:
data2 = {'Name': ['Sanz', 'Pearl', 'Prince', 'Pipa'],
        'Age': [21,33,25,40]}

data2 = pd.DataFrame(data2)

data2

     Name  Age
0    Sanz   21
1   Pearl   33
2  Prince   25
3    Pipa   40

In [15]:
#concatenating two dataframes

new_data= pd.concat([data, data2])
print(new_data)

     Name  Age
0   Pablo   23
1   Susan   24
2    King   25
3   Queen   40
0    Sanz   21
1   Pearl   33
2  Prince   25
3    Pipa   40

#### <span style = 'background:orange'> Data Manipulation Exercises</span>

#### Add a new column

In [39]:
new_data['City'] = ['NY', 'Paris', 'Accra', 'Melbourne', 'Hobart', 'Manchester', 'Bordeaux', 'Tokyo']
new_data

     Name  Age        City
0   Pablo   23          NY
1   Susan   24       Paris
2    King   25       Accra
3   Queen   40   Melbourne
0    Sanz   21      Hobart
1   Pearl   33  Manchester
2  Prince   25    Bordeaux
3    Pipa   40       Tokyo

#### Update Age by +1

In [43]:
new_data['Age']+1

0    24
1    25
2    26
3    41
0    22
1    34
2    26
3    41
Name: Age, dtype: int64